import { Container, Box, Paper, Typography, Divider } from '@material-ui/core'
import React from 'react'

export default function Policy() {
    return (
        <div>
            <Box mt={4} mb={4}><Typography variant="h4" align='center'>이용약관</Typography></Box>
            <Divider />

            <Box mt={4} mb={4}><Typography variant="h6">제 1조 [목적]</Typography></Box>
            <Container><Box mb={4}>본 약관은 코드비가 웹사이트(codeb.co.kr)를 통하여 제공하는 교육정보서비스(이하 “서비스”라 합니다)의 이용과 관련하여 코드비와 회원 사이에 권리ㆍ의무 및 책임사항 등을 규정함을 목적으로 합니다.<br /></Box></Container>
            <Divider />

            <Box mt={4} mb={4}><Typography variant="h6">제 2조 [정의]</Typography></Box>
            <Container><Box mb={4}>①본 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br />
            1.이용자 : 코드비의 웹사이트에 접속하여 본 약관에 따라 코드비가 제공하는 교육 콘텐츠 및 제반서비스를 이용하는 회원 및 비회원<br />
            2.회원 : 코드비의 웹사이트에 접속하여 본 약관에 동의함으로써 코드비와 이용계약을 체결하고 아이디(ID)를 부여받은 자로서 코드비가 제공하는 정보와 서비스를 지속적으로 이용할 수 있는 자<br />
            3.콘텐츠 : 코드비가 제작하여 웹사이트에서 제공 및 판매하는 온라인 강좌 및 기타 관련정보를 의미하며, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 제2조제1항제1호의 규정에 의한 정보통신망에서 사용되는 부호ㆍ문자ㆍ음성ㆍ음향ㆍ이미지 또는 영상 등으로 표현된 자료 또는 정보<br />
            4.아이디(ID) : 회원의 식별 및 서비스 이용을 위하여 회원이 정하고 코드비가 승인하는 문자 또는 숫자의 조합을 말합니다.<br />
            5.비밀번호(PASSWORD) : 서비스 이용 시, 아이디와 일치되는 회원임을 확인하고 회원 개인정보 보호를 위하여 회원 자신이 정한 문자 또는 숫자의 조합<br />
            6.전자우편(Email) : 인터넷을 통한 우편 혹은 전기적 매체를 이용한 우편을 말합니다.<br />
            7.운영자(관리자) : 서비스의 전반적인 관리와 원활한 운영을 위하여 코드비에서 선정한 사람 또는 코드비<br />
            8.탈퇴: 회원이 이용계약을 종료하는 행위<br />
            ②제1항 각 호에 해당하는 정의 이외의 기타 용어의 정의에 대하여는 거래 관행 및 관계 법령에 따릅니다.<br />
            제 3조 [코드비 정보 등의 제공]<br />
            코드비는 상호, 대표자 성명, 주소, 전화번호(소비자의 불만을 처리하는 곳의 연락처 포함), FAX번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호 및 개인정보관리책임자 등을 이용자가 쉽게 알 수 있도록 온라인 서비스 초기화면에 게시합니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 4조 [약관의 효력 및 변경]</Typography></Box>
            <Container><Box mb={4}>①본 약관은 이용자가 약관의 내용에 동의하며 회원가입을 신청하고, 코드비가 그 신청에 대하여 승낙함으로써 효력이 발생합니다.<br />
            ②코드비는 관계법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.<br />
            ③코드비가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여, 개정 전 약관과 함께 적용일 14일 전부터 코드비 웹사이트에서 확인할 수 있도록 게시하며, 기존 회원에게는 본 약관 제5조의 방법을 통하여 약관 개정사실을 통지합니다.<br />
            ④코드비는 기존 회원이 본 약관 제4조 제3항에 따른 공지 또는 통지에도 불구하고, 동 기간 내에 이의를 제기하지 않는 경우에는 변경된 약관을 승인한 것으로 봅니다.<br />
            ⑤기존 회원이 변경된 약관에 동의하지 않는 경우 서비스 이용을 중단하고 회원탈퇴를 할 수 있습니다.<br />
            ⑥본 약관에 명시되지 않은 사항에 대해서는 “약관의 규제에 관한 법률”, “정보통신망 이용촉진 및 정보보호 등에 관한 법률”, “전자상거래 등에서의 소비자보호에 관한 법률”, “학원의 설립·운영 및 과외교습에 관한 법률”, “콘텐츠 산업 진흥법” 및 기타 관련법령 또는 상관례에 따릅니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 5조 [회원에 대한 통지]</Typography></Box>
            <Container><Box mb={4}>①코드비는 회원에게 알려야 할 사항이 발생하는 경우, 회원가입 시 회원이 공개한 전자우편주소, 팝업창, 유ㆍ무선 등의 방법으로 통지할 수 있습니다.<br />
            ②코드비는 회원 전체에 대한 통지의 경우 14일 이상 코드비 웹사이트 게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다. 다만, 회원 본인의 거래 및 사이트의 이용과 관련하여 중대한 영향을 미치는 사항에 대하여는 30일 이상 제1항과 동일한 방법으로 별도 통지할 수 있습니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 6조 [이용계약의 성립]</Typography></Box>
            <Container><Box mb={4}>①이 약관은 서비스를 이용하고자 하는 자가 가입단계에서 동의 버튼을 누르면 약관에 동의하는 것으로 봅니다.<br />
            ②이용 계약은 이 약관 제7조[회원가입]의 회원가입에 대하여 코드비가 이를 승낙함으로써 성립합니다.<br />
            ③회원은 서비스 이용신청 계약을 체결하기 전에 해당 유료서비스에 대하여 코드비가 공지하는 아래와 같은 사항을 사전에 숙지하고, 착오 없이 정확히 거래할 수 있도록 하여야 합니다<br />
            1.서비스의 내용, (이하 유료서비스의 경우) 가격, 이용기간, 이용가능 기기를 포함한 이용방법, 청약철회 및 해지 조건 및 그 방법, 환불에 관한 사항 및 유료서비스의 선택과 관련한 사항<br />
            2.(유료서비스의 경우) 선택한 유료서비스의 결제방법의 선택 및 선택한 결제방법에 필요한 결제정보의 입력<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 7조 [회원가입]</Typography></Box>
            <Container><Box mb={4}>①회원으로 가입하여 코드비 서비스의 이용을 희망하는 자는 약관의 내용을 숙지한 후 동의함을 표시하고, 코드비가 제시하는 소정의 회원가입 양식에 관련사항을 기재하여 회원가입을 신청하여야 합니다.<br />
            ②코드비는 제1항에 따라 이용자가 온라인 회원가입 신청양식에 기재하는 모든 회원정보를 실제 데이터인 것으로 간주합니다.<br />
            ③실명이나 실제 정보를 입력하지 않은 회원은 법적인 보호를 받을 수 없으며, 본 약관의 관련 규정에 따라 서비스 사용에 제한을 받을 수 있습니다.<br />
            ④코드비는 제1항에 따른 이용자의 신청에 대하여 회원가입을 승낙함을 원칙으로 합니다. 다만, 코드비는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않을 수 있으며, 승낙 이후라도 취소할 수 있습니다.<br />
            1.이용자의 귀책사유로 인하여 승인이 불가능한 경우<br />
            2.실명을 사용하지 않은 경우<br />
            3.타인의 명의 또는 개인정보를 도용하는 경우<br />
            4.허위의 정보를 제공하는 경우<br />
            5.중복된 아이디를 사용하는 경우<br />
            6.코드비가 제시하는 회원가입 신청양식에 관련 내용을 기재하지 않은 경우<br />
            7.이전에 코드비 이용약관 또는 관계법령을 위반하여 회원자격이 상실되었던 경우<br />
            8.본 약관 제12조[회원의 의무]를 위반하는 경우<br />
            9.만14세 미만의 아동인 경우<br />
            ⑤코드비는 서비스 관련 설비의 여유가 없거나 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.<br />
            ⑥코드비가 제4항과 제5항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우에는 팝업창을 통하여 즉시 이용자(신청자)에게 알립니다. 단, 코드비의 귀책사유 없이 이용자에게 알릴 수 없는 경우에는 예외로 합니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 8조 [회원정보의 변경]</Typography></Box>
            <Container><Box mb={4}>①회원은 코드비 웹사이트 “정보수정” 페이지에서 언제든지 자신의 개인정보를 열람하고 수정할 수 있습니다.<br />
            ②회원이 제1항의 변경사항을 수정하지 않아 발생한 불이익에 대하여 코드비는 책임지지 않습니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 9조 [이용계약의 해지·해제 등]</Typography></Box>
            <Container><Box mb={4}>①회원은 언제든지 서비스 초기화면의 고객센터 또는 마이페이지 등을 통하여 이용계약 해지 신청을 할 수 있으며, 코드비는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.<br />
            ②회원이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 코드비가 관계법령규정 또는 교육이력 유지를 위한 최소한의 개인정보(이름, 생년월일, 수료증번호) 등 보존할 필요가 있는 경우를 제외하고는 해지 즉시 회원의 모든 데이터는 소멸됩니다.<br />
            ③코드비는 회원이 본 약관 또는 관계법령 등을 위반하는 경우, 이용계약을 해지할 수 있습니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 10조 [코드비의 의무]</Typography></Box>
            <Container><Box mb={4}>①코드비는 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.<br />
            ②코드비는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보취급방침을 공시하고 준수합니다.<br />
            ③코드비는 회원 개인의 정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않는 것을 원칙으로 합니다. 단, 아래 사항에 해당하는 경우는 예외로 인정합니다.<br />
            1.정보통신망법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우<br />
            2.범죄에 대해 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우<br />
            3.기타 관계법령이 정한 절차에 따른 요청이 있는 경우<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 11조 [회원의 의무]</Typography></Box>
            <Container><Box mb={4}>①코드비의 명시적 동의가 없는 한 회원의 이용권한은 회원 개인에 한정되며, 타인에게 양도, 증여하거나 이를 담보 등으로 제공할 수 없습니다.<br />
            ②코드비는 회원이 다음 각 호의 1에 해당하는 의무를 위반하였을 경우, 기간을 정하여 전부 또는 일부의 서비스 이용을 중지하거나 상당기간의 최고 후 이용계약을 해지할 수 있습니다.<br />
            1.회원이 이용신청 또는 변경 시, 허위사실을 기재하거나 자신 또는 다른 회원의 ID 및 개인정보를 이용ㆍ공유하는 경우<br />
            2.회원이 코드비 또는 제3자의 권리 등을 침해하는 경우<br />
            3.회원이 코드비에서 제공하는 서비스를 이용하여 상품 또는 용역을 판매하는 영업활동 등의 상행위를 하는 경우<br />
            4.회원이 다른 이용자의 서비스 이용을 방해하거나 코드비의 운영진, 직원 또는 관계자를 사칭하는 경우<br />
            5.회원이 코드비 웹사이트 내에서 사회의 안녕질서 혹은 미풍양속을 저해하는 행위를 하거나, 그와 관련된 부호ㆍ문자ㆍ음성ㆍ음향 및 영상 등의 정보를 게시하여 타인에게 유포시키는 경우<br />
            6.회원이 코드비로부터 유ㆍ무상으로 제공받은 캐쉬 등의 재화를 제3자와 유ㆍ무상 등의 방법으로 거래하는 경우<br />
            7.코드비의 서비스 운영을 고의로 방해하거나 그리할 목적으로 다량의 정보를 전송하거나 광고성 정보를 전송하는 경우<br />
            8.관계법령 및 기타 본 약관에서 규정한 사항을 위반한 경우<br />
            9.코드비 및 타인의 명예를 훼손하거나 모욕하는 경우 등<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 12조 [회원 아이디 및 비밀번호의 관리에 대한 의무]</Typography></Box>
            <Container><Box mb={4}>①회원은 아이디와 비밀번호에 대한 관리책임이 있으며, 이를 타인에게 공개하여 제3자가 이용하도록 하여서는 안됩니다.<br />
            ②회원은 자신의 아이디 및 비밀번호가 유출되어 제3자에 의해 사용되고 있음을 인지한 경우, 즉시 코드비에 알려야 합니다.<br />
            ③코드비는 전항의 경우 회원의 개인정보보호 및 기타 서비스 부정이용행위 방지 등을 위하여 회원에게 비밀번호의 변경 등 필요한 조치를 요구할 수 있으며, 회원은 코드비의 요구가 있는 즉시 코드비의 요청에 성실히 응해야 합니다.<br />
            ④코드비는 회원이 제9조제2항 및 제3항에 따른 의무를 성실히 이행하지 않아 발생한 불이익에 대하여 책임지지 않습니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 13조 [콘텐츠 이용에 필요한 기술사양]</Typography></Box>
            <Container><Box mb={4}>①코드비가 제공하는 콘텐츠를 이용하는데 필요한 PC 및 전자기기의 최소사양은 아래와 같습니다.<br />
            CPU: Pentium4 2.4 이상<br />
            메모리: 2G 이상<br />
            HDD: C: 공간이 20G이상<br />
            VGA : NVIDIA GeForce FX 5200 128MB 또는 ATI Radeon 9500 128MB 이상<br />
            운영체제 : Windows 7 이상<br />
            DirectX : 9.0 이상<br />
            Internet Explorer : 9.0 이상<br />
            ②코드비가 제공하는 콘텐츠를 이용할 수 있는 휴대폰 등 학습기기의 회사 웹사이트 내에서 확인할 수 있습니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 14조 [거래조건에 대한 정보의 표시]</Typography></Box>
            <Container><Box mb={4}>①코드비는 다음 각 호에 해당하는 사항을 해당 콘텐츠 또는 그 포장에 표시합니다.<br />
            1.콘텐츠의 명칭, 종류, 내용, 가격, 이용기간<br />
            2.콘텐츠 이용에 필요한 전자매체의 최소한의 기술사양<br />
            3.휴대가 가능한 학습용 전자기기의 사용가능 여부<br />
            4.환불기준 등 서비스 이용계약의 해지방법 및 효과<br />
            5.이용약관 및 개인정보처리방침<br />
            ②코드비는 제1항 각 호의 사항을 코드비 웹사이트, 본 이용약관, 개인정보처리방침 등에서 이미 고지하고 있는 경우, 별도로 표시하지 않을 수 있습니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 15조 [유료서비스 이용계약의 성립 및 결제방법 등]</Typography></Box>
            <Container><Box mb={4}>①회원은 코드비가 제공하는 다음 각 호 또는 이와 유사한 절차에 의하여 콘텐츠 서비스 이용 신청을 합니다. 코드비는 계약 체결 전, 다음 각 호의 사항에 관하여 회원이 정확하게 이해하고 실수 또는 착오 없이 거래할 수 있도록 정보를 제공합니다.<br />
            1.교육과정목록의 열람 및 선택<br />
            2.콘텐츠 상세정보 확인<br />
            3.신청서 작성<br />
            4.승인대기<br />
            5.결제금액 확인(환불규정 안내)<br />
            6.결제수단 선택<br />
            7.결제금액 재확인<br />
            8.결제<br />
            ②회원은 신용카드, 실시간계좌이체 등 코드비에서 정하고 있는 방법으로 유료서비스의 결제가 가능합니다. 다만, 각 결제수단마다 결제수단의 특성에 따른 일정한 제한이 있을 수 있습니다.<br />
            ③코드비는 회원의 유료서비스 이용신청이 다음 각 호에 해당하는 경우에는 승낙하지 않거나, 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.<br />
            1.유료 서비스의 이용요금을 납입하지 않는 경우<br />
            2.유료 서비스 신청금액 총액과 입금총액이 일치하지 않은 경우<br />
            3.기타 합리적인 이유가 있는 경우로서 코드비가 필요하다고 인정되는 경우<br />
            ④코드비는 회원이 본조 위 조항의 절차에 따라 유료서비스 이용을 신청할 경우, 승낙의 의사표시로써 본 약관 제5조의 방법을 통하여 회원에게 통지하고, 승낙의 통지가 회원에게 도달한 시점에 계약이 성립한 것으로 봅니다.<br />
            ⑤코드비의 승낙 의사표시에는 회원의 이용신청에 대한 확인 및 서비스제공 가능여부, 이용신청의 정정, 취소 등에 관한 정보 등을 포함합니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 16조 [서비스의 이용시간]</Typography></Box>
            <Container><Box mb={4}>①서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 정기점검 등 코드비의 업무상 또는 기술상의 이유로 서비스가 일시 중지될 수 있으며, 운영상의 목적으로 코드비가 정한 기간에는 서비스가 일시 중지될 수 있습니다. 이러한 경우 코드비는 원칙적으로 서비스의 일시 중지 사실 및 중지 기간을 사전에 공지하되, 이를 미리 공지할 수 없는 급박하거나 불가피한 사정이 있을 때에는 사후에 즉시 공지합니다.<br />
            ②코드비는 서비스를 일정범위로 분할하여 각 범위 별로 이용 가능한 시간을 별도로 정할 수 있으며 이 경우 그 내용을 공지합니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 17조 [서비스의 변경 및 중지]</Typography></Box>
            <Container><Box mb={4}>①코드비는 상당한 이유가 있는 경우 운영상, 기술상 필요에 따라 서비스를 변경할 수 있으며, 이 경우 변경될 서비스의 내용 및 제공일자를 제4조[약관의 효력 및 변경] 제3항에서 정한 방법으로 회원에게 통지합니다. 단 변경된 내용이 중대하거나 회원에게 불리한 경우에는 코드비가 회원으로부터 이 약관에서 정한 방법으로 통지하고 동의를 받습니다.<br />
            ②코드비는 다음 각 호에 해당하는 경우 서비스의 전부 또는 일부를 일시적으로 제한하거나 중지할 수 있습니다.<br />
            1.서비스용 설비의 보수 등 공사로 인한 부득이한 경우<br />
            2.회원이 의도적으로 일정기간 내 특정서비스의 가입 및 해지를 반복하는 등 코드비의 정상적 영업 및 서비스 제공 활동을 방해하는 경우<br />
            3.정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우<br />
            4.서비스 제공업자와의 계약 종료 등과 같은 코드비의 제반 사정으로 서비스를 유지할 수 없는 경우<br />
            5.기타 천재지변, 국가비상사태, 방송통신위원회, 한국정보보호진흥원 등 국가기관, 정부조직, 수사기관, 법원 등의 행정ㆍ사법 처분 등 행정행위로 인한 서비스 중단 등 코드비가 통제할 수 없는 불가항력적 사유가 있는 경우<br />
            ③제2항에 의한 서비스 중단의 경우에는 코드비가 제4조[약관의 효력 및 변경] 제3항에서 정한 방법으로 이용자에게 통지합니다. 다만, 미리 통지하는 것이 곤란하거나 급박하거나 불가피한 사정이 있는 경우에는 사후에 통지할 수 있습니다.<br />
            ④코드비는 무료로 제공되는 서비스의 일부 또는 전부를 코드비의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 회원에게 별도의 보상을 하지 않습니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 18조 [게시물 또는 내용물의 삭제]</Typography></Box>
            <Container><Box mb={4}>①코드비는 회원이 게시하거나 전달하는 서비스 내의 내용물(회원간 전달 포함)이 다음 각 호의 경우에 해당한다고 판단되는 경우 사전통지 없이 삭제할 수 있으며, 이에 대해 코드비는 어떠한 책임도 지지 않습니다.<br />
            1.코드비, 다른 회원 또는 제3자를 비방하거나 중상모략으로 명예를 손상시키는 내용인 경우<br />
            2.공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등의 유포에 해당하는 경우<br />
            3.범죄적 행위에 결부된다고 인정되는 내용인 경우<br />
            4.코드비의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우<br />
            5.제2항 소정의 세부이용지침을 통하여 코드비에서 규정한 게시기간을 초과한 경우<br />
            6.코드비에서 제공하는 서비스와 관련 없는 내용인 경우<br />
            7.승인되지 않은 광고, 판촉물을 게재하는 경우<br />
            8.기타 관계 법령 및 코드비의 지침 등에 위반된다고 판단되는 경우<br />
            ②코드비는 게시물에 관련된 세부 이용지침을 별도로 정하여 시행할 수 있으며, 회원은 그 지침에 따라 각종 게시물(회원간 전달 포함)을 등록하거나 삭제하여야 합니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 19조 [이용자의 개인정보보호]</Typography></Box>
            <Container><Box mb={4}>코드비는 관련 법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보를 보호하기 위하여 노력합니다. 회원의 개인정보보호에 관해서는 관련법령 및 코드비가 정하는 "개인정보취급방침"에 정한 바에 의합니다. 특히, 코드비는 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관계 법령에 따라 회원의 사전 동의를 얻은 경우, 동의를 받은 범위 내에서 회원의 개인정보를 제3자에게 제공하며, 코드비의 ‘개인정보취급방침’에 그 절차와 방법 등에 대하여 상세히 기재하도록 합니다.<br />
            코드비가 서비스 홈페이지를 통하여 게재, 공시하는 '개인정보취급방침'은 이 약관의 일부를 구성하며, 회원은 이에 동의합니다.<br /></Box></Container>


            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 20조 [개인정보의 수집, 제공 및 취급 위탁]</Typography></Box>
            <Container><Box mb={4}>코드비는 수집된 개인정보의 취급 및 관리 등의 업무(이하 “업무”)를 스스로 수행함을 원칙으로 하나, 필요한 경우 업무의 일부 또는 전부를 코드비가 선정한 업체에 위탁할 수 있으며, 개인정보의 취급 및 관리 등의 업무를 제3자 등에게 위탁하게 될 경우, 코드비가 정하는 “개인정보취급방침”에 제반 사항을 기재하여 회원에게 고지, 안내하고 있습니다.</Box></Container>


            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 21조 [손해 배상]</Typography></Box>
            <Container><Box mb={4}>①코드비의 고의 또는 중대한 과실로 인하여 회원에게 손해가 발생한 경우 코드비는 회원에게 실제 발생한 손해만을 배상합니다.<br />
            ②회원이 서비스를 이용함에 있어 행한 불법행위나 이 약관 위반행위로 인하여 코드비가 당해 회원 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 회원은 자신의 책임과 비용으로 코드비를 면책하여야 하며, 코드비가 면책되지 못한 경우 당해 회원은 그로 인하여 코드비에 발생한 모든 손해를 배상하여야 합니다.<br /></Box></Container>

            <Divider />
            <Box mt={4} mb={4}><Typography variant="h6">제 22조 [면책사항]</Typography></Box>
            <Container><Box mb={4}>①코드비는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.<br />
            ②코드비는 회원의 귀책사유로 인한 서비스의 이용장애에 대하여 책임을 지지 않습니다.<br />
            ③코드비는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며 그 밖에 서비스를 통하여 얻은 자료로 인한 손해 등에 대하여도 책임을 지지 않습니다. 코드비는 회원이 사이트에 게재한 정보, 자료, 사실의 신뢰도 및 정확성 등 내용에 대하여는 책임을 지지 않습니다.<br />
            ④코드비는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다.<br />
            제 23조 [관할법원]<br />
            ①서비스 이용과 관련하여 코드비와 회원 사이에 분쟁이 발생한 경우, 코드비와 회원은 분쟁의 해결을 위해 성실히 협의하고, 협의가 안될 경우 콘텐츠산업진흥법상 콘텐츠분쟁조정위원회에 분쟁조정을 신청할 수 있습니다.<br />
            ②제1항의 협의에서도 분쟁이 해결되지 않을 경우 양 당사자는 소를 제기할 수 있으며, 코드비와 회원 간의 소의 관할은 민사소송법에 따라 관할법원을 정합니다.<br />
            부칙<br />
            (시행일) 이 약관은 2021년 3월 25일부터 시행합니다.<br /></Box></Container>
        </div>
    )
}
